(function(){
	miData = {
		//stargoods
		starGoods:{
			imgSrc : ["images/stargoods/1.png","images/stargoods/2.png","images/stargoods/3.png","images/stargoods/4.jpg","images/stargoods/5.png","images/stargoods/6.png","images/stargoods/7.jpg","images/stargoods/8.jpg","images/stargoods/9.png","images/stargoods/10.png"],
			title : ['小米手机5 尊享版','小米手机5 尊享版','小米手机5 尊享版','小米手机5 尊享版','小米手机5 尊享版','小米手机5 尊享版','小米手机5 尊享版','小米手机5 尊享版','小米手机5 尊享版','小米手机5 尊享版'],
			datail : ['4GB内存+128GB闪存.陶瓷版','4GB内存+128GB闪存.陶瓷版','4GB内存+128GB闪存.陶瓷版','4GB内存+128GB闪存.陶瓷版','4GB内存+128GB闪存.陶瓷版','4GB内存+128GB闪存.陶瓷版','4GB内存+128GB闪存.陶瓷版','4GB内存+128GB闪存.陶瓷版','4GB内存+128GB闪存.陶瓷版','4GB内存+128GB闪存.陶瓷版'],
			price : ['2699元','2699元','2699元','2699元','2699元','2699元','2699元','2699元','2699元','2699元']
		},
		recommend:{
			imgSrc : ["images/recommend/1.jpg","images/recommend/2.jpg","images/recommend/3.jpg","images/recommend/4.jpg","images/recommend/5.jpg","images/recommend/6.jpg","images/recommend/7.jpg","images/recommend/8.jpg","images/recommend/9.jpg","images/recommend/10.jpg"],
			title : ['米家骑记电助力折叠自行车','米椒恒温电水壶','小米假定影院','小米笔记本内胆包12.5英寸','小米小钢炮蓝牙音箱2','小米WIFI放大器2','小米笔记本内胆包13.3英寸','90分旅行箱20寸','小米笔记本Air13.3英寸','小米笔记本Air13.3英寸尊享版'],
			datail : ['4GB内存+128GB闪存.陶瓷版','4GB内存+128GB闪存.陶瓷版','4GB内存+128GB闪存.陶瓷版','4GB内存+128GB闪存.陶瓷版','4GB内存+128GB闪存.陶瓷版','4GB内存+128GB闪存.陶瓷版','4GB内存+128GB闪存.陶瓷版','4GB内存+128GB闪存.陶瓷版','4GB内存+128GB闪存.陶瓷版','4GB内存+128GB闪存.陶瓷版'],
			price : ['2699元','2699元','2699元','2699元','2699元','2699元','2699元','2699元','2699元','2699元']
		},
		match:{
			hot:{
					title:["小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源"],
					price:["29元","79元","99元","149元","49元","79元","29元","29元"],
					comment:["5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价"]
			},
			ear:{
					title:["小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源"],
					price:["29元","79元","99元","149元","49元","79元","29元","29元"],
					comment:["5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价"]
			},
			power:{
					title:["小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源"],
					price:["29元","79元","99元","149元","49元","79元","29元","29元"],
					comment:["5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价"]
			},
			card:{
				title:["小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源"],
				price:["29元","79元","99元","149元","49元","79元","29元","29元"],
				comment:["5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价"]
			},
			length:4,
			attr:["hot","ear","power","card"]
		},
		peijian:{
			hot:{
					title:["小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源"],
					price:["29元","79元","99元","149元","49元","79元","29元","29元"],
					comment:["5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价"]
			},
			baohutao:{
					title:["小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源"],
					price:["29元","79元","99元","149元","49元","79元","29元","29元"],
					comment:["5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价"]
			},
			tiemo:{
					title:["小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源"],
					price:["29元","79元","99元","149元","49元","79元","29元","29元"],
					comment:["5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价"]
			},
			else:{
				title:["小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源"],
				price:["29元","79元","99元","149元","49元","79元","29元","29元"],
				comment:["5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价"]
			},
			length:4,
			attr:["hot","baohutao","tiemo","else"]
		},
		zhoubian:{
			hot:{
					title:["小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源"],
					price:["29元","79元","99元","149元","49元","79元","29元","29元"],
					comment:["5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价"]
			},
			coat:{
					title:["小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源"],
					price:["29元","79元","99元","149元","49元","79元","29元","29元"],
					comment:["5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价"]
			},
			mitu:{
					title:["小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源"],
					price:["29元","79元","99元","149元","49元","79元","29元","29元"],
					comment:["5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价"]
			},
			life:{
				title:["小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源"],
				price:["29元","79元","99元","149元","49元","79元","29元","29元"],
				comment:["5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价"]
			},
			bag:{
				title:["小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源","小米圈铁耳机","小米活塞耳机 基础班","小米移动电源"],
				price:["29元","79元","99元","149元","49元","79元","29元","29元"],
				comment:["5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价","5.1万人评价"]
			},
			length:5,
			attr:["hot","coat","mitu","life","bag"]
		}

	}
})();